CodeIgniter Base de Datos/app/Models/UsuarioModelo.php

    public function obtenerUsuariosConRoles()
    {
        return $this->select('
                            tbl_usuarios.usu_id,
                            tbl_usuarios.usu_nombre,
                            tbl_usuarios.usu_apellido,
                            tbl_usuarios.usu_correo,
                            tbl_roles.rol_descripcion,
                            tbl_roles.rol_estado
                            ')
                            ->join(
                                'tbl_roles',
                                'tbl_roles.rol_id = tbl_usuarios.rol_id',
                                'left'
                                )
                            ->findAll();
---
SELECT `tbl_usuarios`.`usu_id`, `tbl_usuarios`.`usu_nombre`, `tbl_usuarios`.`usu_apellido`, `tbl_usuarios`.`usu_correo`, `tbl_roles`.`rol_descripcion`, `tbl_roles`.`rol_estado`
FROM `tbl_usuarios`
LEFT JOIN `tbl_roles` ON `tbl_roles`.`rol_id` = `tbl_usuarios`.`rol_id`